 // - створити функцію яка обчислює та повертає площу прямокутника зі сторонами а і б

// function rectangle(a, b) {
//     return a*b;
// }
// let x1 = rectangle(4, 6);
//  console.log(x1);
 // ---------------------------------------------------------------------------------------------------------------------

 // - створити функцію яка обчислює та повертає площу кола з радіусом r


 // function circle(r) {
 //     return 3.14*r**2;
 // }
 //    let x2 = circle(r);
 //     console.log(x2);
 // ---------------------------------------------------------------------------------------------------------------------
 // - створити функцію яка обчислює та повертає площу циліндру висотою h, та радіутом r

 // function cylinder(2π, h, r) {
 //    return 2*3.14*r*h;
 // }
 // let x3 = cylinder(2π, 3, 9);
 // console.log(x3);
 // ---------------------------------------------------------------------------------------------------------------------
 // - створити функцію яка приймає масив та виводить кожен його елемент

//  function days (monday, tuesday, wednesday) {
//      document.write(`
//      <div>
//      <h2>понеділок - ${monday}, вівторок - ${tuesday}, середа - ${wednesday} </h2>
// </div>
//      `)
//  }
//
//  let day =[
//      {monday:'monday1', tuesday:'tuesday1', wednesday:'wednesday1'},
//      {monday:'monday2', tuesday:'tuesday2', wednesday:'wednesday2'},
//      {monday:'monday3', tuesday:'tuesday3', wednesday:'wednesday3'},
//  ]
 // for (const dayElement of day) {
 //     days(dayElement.monday, dayElement.tuesday, dayElement.wednesday)
//  }

 // ---------------------------------------------------------------------------------------------------------------------
// - створити функцію яка створює параграф з текстом. Текст задати через аргумент
 function text (a) {
  document.write(`<div><p>Lorem ipsum dolor sit amet, consectetur adipisicing elit. Blanditiis, eligendi.</p></div>
  ` )
 }
 text()

 // ---------------------------------------------------------------------------------------------------------------------
//  - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий

 // ---------------------------------------------------------------------------------------------------------------------
//  - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий. Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)
//  - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список
//  - створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ. Для кожного об'єкту окремий блок.
//  - створити функцію яка повертає найменьше число з масиву
//  - створити функцію sum(arr)яка приймає масив чисел, сумує значення елементів масиву та повертає його. Приклад sum([1,2,10]) //->13
//  - створити функцію swap(arr,index1,index2). Функція міняє місцями заняення у відаовідних індексах
//  Приклад  swap([11,22,33,44],0,1) //=> [22,11,33,44]
//  - Написати функцію обміну валюти exchange(sumUAH,currencyValues,exchangeCurrency)
//  Приклад exchange(10000,[{currency:'USD',value:40},{currency:'EUR',value:42}],'USD') // => 250

